
&НаКлиенте
Процедура РабочийКаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = "Путь для сканирования";
	Если Диалог.Выбрать() Тогда
		Объект.РабочийКаталог = Диалог.Каталог;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьСканирование(Команда)

	Если Объект.ЗадержкаСканирования > 0 Тогда
		ПодключитьОбработчикОжидания("ОбработчикОжиданияСканирования", Объект.ЗадержкаСканирования);
	Иначе
		ВыполнитьСканирование();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьСканирование()
	
	Модуль = РеквизитФормыВЗначение("Объект");
	Модуль.Сканирование();
	ЗначениеВРеквизитФормы(Модуль, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОжиданияСканирования()
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Сканирование: " + Строка(ТекущаяДата());
	Сообщение.Сообщить();
	ВыполнитьСканирование();
	
КонецПроцедуры	

